src/cf/src/Documents/ПередачаВПереработку/ПередачаВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаВПереработку</name>
  <basedOn>Document.ВыпускПродукции</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВПереработке</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПриходныйДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <comment>Полуфабрикат или готовая продукция заказа, для которой передаётся материал (2.0.16.16); пусто - по правилу заказа</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <comment>Сколько ПФ/ГП ожидается из материала строки, в базовых единицах ПФ/ГП (2.0.16.17); 0 - по правилу заказа</comment>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧГотоваяПродукция</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Станки</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ПроизводственноеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Documents/ПередачаВПереработку/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтотОбъект);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтотОбъект);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтотОбъект, Объект);
	РаботаСДокументами.ОграничитьВидимостьРеквизитовПоТипу(ЭтотОбъект, "ОператорПроизводства");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПоказатьСебестоимость();
	// Записанный документ автопересчётом не трогается: его продукция согласована с переработчиком, и правка строки
	// товаров не повод переписывать её молча. Вернуть расчёт - кнопкой «Заполнить по заказу».
	ПродукцияПравиласьВручную = Истина;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПоказатьСебестоимость();
	// Записанный документ автопересчётом не трогается, как и прочитанный: форма могла остаться открытой.
	ПродукцияПравиласьВручную = Истина;
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" И ВводДоступен() Тогда
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		СтруктураТовара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
		Если СтруктураТовара = Неопределено Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеДобавленияНоменклатуры", ЭтотОбъект, Новый Структура("Штрихкод", Штрихкод));
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", Новый Структура("Штрихкод", Штрихкод), ЭтотОбъект, , , ,
				Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод, Объект, СтруктураТовара, , , ЭтотОбъект);
			// Сканирование - штатный способ набора строк этого документа, оборудование подключается при открытии формы.
			ПересобратьОжидаемуюПродукцию();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЧТовары

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект, Ложь);
	// ПФ/ГП подбирается к материалу: у другого материала прежний может быть недопустим.
	Элементы.ТЧТовары.ТекущиеДанные.Продукция = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	Элементы.ТЧТовары.ТекущиеДанные.КоличествоПродукции = 0;
	ПересобратьОжидаемуюПродукцию();
КонецПроцедуры

// Ожидаемая продукция считается по переданным строкам, а строку удаляют ПОСЛЕ этого события: удаляемая строка
// исключается из расчёта явно, события «после удаления» у таблицы формы нет.
//
// Параметры:
//  Элемент - ТаблицаФормы - строки товаров.
//  Отказ   - Булево - не используется.
//
&НаКлиенте
Процедура ТЧТоварыПередУдалением(Элемент, Отказ)
	// Платформа удаляет ВСЕ выделенные строки, а событие приходит один раз: из расчёта исключаются они все.
	Идентификаторы = Новый Массив;
	Для Каждого Идентификатор Из Элемент.ВыделенныеСтроки Цикл
		Идентификаторы.Добавить(Идентификатор);
	КонецЦикла;
	Если Идентификаторы.Количество() = 0 И Элемент.ТекущаяСтрока <> Неопределено Тогда
		Идентификаторы.Добавить(Элемент.ТекущаяСтрока);
	КонецЕсли;
	ПересобратьОжидаемуюПродукцию(Идентификаторы);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыПолученияДанных.Вставить("ВыводитьСерию", Истина);
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение,
		Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные);
	ПересобратьОжидаемуюПродукцию();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	ДанныеОтбора = Новый Структура("Номенклатура, Характеристика");
	ЗаполнитьЗначенияСвойств(ДанныеОтбора, ТекСтр);
	ДанныеОтбора.Вставить("МестоХранения", Объект.МестоХранения);
	ДанныеОтбора.Вставить("ВсеСерии", Истина);
	СерииИРазмещениеКлиент.ВыбратьСериюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект),
		ДанныеОтбора, , ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	ПрежнееКоличество = ТекСтр.Количество;
	РаботаСДокументамиКлиентСервер.РассчитатьКоличество(ТекСтр);
	// Норма ПФ/ГП пересчитывается, если количество ПФ/ГП пустое или равно норме прежнего количества материала
	// (подставлено автоматически); введённое руками не перетирается (гейт и ревью 2.0.16.17).
	Если ЗначениеЗаполнено(ТекСтр.Продукция) Тогда
		Нормы = НормыПродукцииСтроки(Объект.Основание, ТекСтр.Номенклатура, ТекСтр.Характеристика, ПрежнееКоличество,
			ТекСтр.Количество, ТекСтр.Продукция);
		Если ТекСтр.КоличествоПродукции = 0 Или ТекСтр.КоличествоПродукции = Нормы.Прежняя Тогда
			ТекСтр.КоличествоПродукции = Нормы.Новая;
		КонецЕсли;
	КонецЕсли;
	ПересобратьОжидаемуюПродукцию();
КонецПроцедуры

// ПФ/ГП строки меняет состав ожидаемой продукции передачи.
//
// Параметры:
//  Элемент - ПолеФормы - колонка «ПФ/ГП».
//
&НаКлиенте
Процедура ТЧТоварыПродукцияПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	Если ТекСтр <> Неопределено Тогда
		// Смена ПФ/ГП - его норма, в том числе 0: количество прежнего ПФ/ГП не остаётся.
		ТекСтр.КоличествоПродукции = НормаПродукцииСтроки(Объект.Основание, ТекСтр.Номенклатура, ТекСтр.Характеристика,
			ТекСтр.Количество, ТекСтр.Продукция);
	КонецЕсли;
	ПересобратьОжидаемуюПродукцию();
КонецПроцедуры

// Количество ПФ/ГП строки (2.0.16.17) меняет ожидаемую продукцию передачи.
//
// Параметры:
//  Элемент - ПолеФормы - колонка «Кол-во ПФ/ГП».
//
&НаКлиенте
Процедура ТЧТоварыКоличествоПродукцииПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	// Без ПФ/ГП количество ПФ/ГП не хранится: расчёт его не видит, а сравнение строк сбивал бы.
	Если ТекСтр <> Неопределено И Не ЗначениеЗаполнено(ТекСтр.Продукция) Тогда
		ТекСтр.КоличествоПродукции = 0;
	КонецЕсли;
	ПересобратьОжидаемуюПродукцию();
КонецПроцедуры

// ПФ/ГП строки - только из заказа-основания: прямые родители материала в его дереве или продукция строк товаров.
//
// Параметры:
//  Элемент              - ПолеФормы - колонка «ПФ/ГП».
//  ДанныеВыбора         - СписокЗначений - не используется.
//  СтандартнаяОбработка - Булево - выбор из справочника отключается.
//
&НаКлиенте
Процедура ТЧТоварыПродукцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Список = ДопустимаяПродукцияСтроки(Объект.Основание, ТекСтр.Номенклатура);
	Если Список.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'У материала нет ПФ/ГП в заказе-основании.';
			|fr = 'La matière n''a pas de semi-fini / produit fini dans la commande de base.';
			|en = 'The material has no semi-finished / finished product in the base order.';
			|es = 'El material no tiene semielaborado / producto terminado en el pedido base.'"));
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораПродукцииСтроки", ЭтотОбъект, Элементы.ТЧТовары.ТекущаяСтрока);
	ПоказатьВыборИзСписка(Оповещение, Список, Элемент);
КонецПроцедуры

// Параметры:
//  Выбранный     - ЭлементСпискаЗначений, Неопределено - выбранный ПФ/ГП.
//  Идентификатор - Число - идентификатор строки товаров.
//
&НаКлиенте
Процедура ПослеВыбораПродукцииСтроки(Выбранный, Идентификатор) Экспорт
	Если Выбранный = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекСтр = Объект.ТЧТовары.НайтиПоИдентификатору(Идентификатор);
	Если ТекСтр = Неопределено Или ТекСтр.Продукция = Выбранный.Значение Тогда
		Возврат;
	КонецЕсли;
	ТекСтр.Продукция = Выбранный.Значение;
	// Норма подставляется при выборе ПФ/ГП (решение владельца 2026-10-06: по норме, можно править).
	ТекСтр.КоличествоПродукции = НормаПродукцииСтроки(Объект.Основание, ТекСтр.Номенклатура, ТекСтр.Характеристика,
		ТекСтр.Количество, ТекСтр.Продукция);
	Модифицированность = Истина;
	ПересобратьОжидаемуюПродукцию();
КонецПроцедуры

// Параметры:
//  Заказ             - ДокументСсылка.ЗаказПокупателя, Произвольный - основание передачи.
//  Материал          - СправочникСсылка.Номенклатура - материал строки.
//  Характеристика    - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика материала.
//  ПрежнееКоличество - Число - количество материала до правки, базовые единицы.
//  Количество        - Число - количество материала после правки, базовые единицы.
//  Продукция         - СправочникСсылка.Номенклатура - ПФ/ГП строки.
//
// Возвращаемое значение:
//  Структура - Прежняя, Новая (Число) - нормы ПФ/ГП до и после правки количества.
//
&НаСервереБезКонтекста
Функция НормыПродукцииСтроки(Знач Заказ, Знач Материал, Знач Характеристика, Знач ПрежнееКоличество, Знач Количество,
	Знач Продукция)
	Менеджер = Документы.ПередачаВПереработку;
	Прежняя = Менеджер.КоличествоПродукцииПоНорме(Заказ, Материал, Характеристика, ПрежнееКоличество, Продукция);
	Новая = Менеджер.КоличествоПродукцииПоНорме(Заказ, Материал, Характеристика, Количество, Продукция);
	Возврат Новый Структура("Прежняя, Новая", Прежняя, Новая);
КонецФункции

// Параметры:
//  Заказ          - ДокументСсылка.ЗаказПокупателя, Произвольный - основание передачи.
//  Материал       - СправочникСсылка.Номенклатура - материал строки.
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика материала.
//  Количество     - Число - количество материала в базовых единицах.
//  Продукция      - СправочникСсылка.Номенклатура - ПФ/ГП строки.
//
// Возвращаемое значение:
//  Число - см. Документы.ПередачаВПереработку.КоличествоПродукцииПоНорме.
//
&НаСервереБезКонтекста
Функция НормаПродукцииСтроки(Знач Заказ, Знач Материал, Знач Характеристика, Знач Количество, Знач Продукция)
	Возврат Документы.ПередачаВПереработку.КоличествоПродукцииПоНорме(Заказ, Материал, Характеристика, Количество,
		Продукция);
КонецФункции

// Параметры:
//  Заказ    - ДокументСсылка.ЗаказПокупателя, Произвольный - основание передачи.
//  Материал - СправочникСсылка.Номенклатура - материал строки.
//
// Возвращаемое значение:
//  СписокЗначений - допустимые ПФ/ГП, см. Документы.ПередачаВПереработку.ДопустимаяПродукцияМатериала.
//
&НаСервереБезКонтекста
Функция ДопустимаяПродукцияСтроки(Знач Заказ, Знач Материал)
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(Документы.ПередачаВПереработку.ДопустимаяПродукцияМатериала(Заказ, Материал));
	Возврат Список;
КонецФункции

&НаКлиенте
Процедура ТЧТоварыПартияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеОтбора = Новый Структура("МестоХранения, Номенклатура, Характеристика",
		Объект.МестоХранения, ТекСтр.Номенклатура, ТекСтр.Характеристика);
	ПартииИРазмещениеКлиент.ВыбратьПартиюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект),
		ДанныеОтбора, , ТекСтр);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЧГотоваяПродукция

&НаКлиенте
Процедура ТЧГотоваяПродукцияНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧГотоваяПродукция.ТекущиеДанные, Объект, Ложь);
	ПродукцияПравиласьВручную = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТЧГотоваяПродукцияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧГотоваяПродукция);
		ПродукцияПравиласьВручную = Истина;
	КонецЕсли;
КонецПроцедуры

// Удаление строки продукции - тоже ручная правка: без этого удалённая строка вернулась бы следующим пересчётом.
//
// Параметры:
//  Элемент - ТаблицаФормы - строки продукции.
//  Отказ   - Булево - не используется.
//
&НаКлиенте
Процедура ТЧГотоваяПродукцияПередУдалением(Элемент, Отказ)
	ПродукцияПравиласьВручную = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТЧГотоваяПродукцияНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыПолученияДанных.Вставить("ВыводитьСерию", Истина);
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧГотоваяПродукцияНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧГотоваяПродукция.ТекущиеДанные, ВыбранноеЗначение,
		Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧГотоваяПродукцияУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧГотоваяПродукция.ТекущиеДанные);
	ПродукцияПравиласьВручную = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТЧГотоваяПродукцияКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьКоличество(Элементы.ТЧГотоваяПродукция.ТекущиеДанные);
	ПродукцияПравиласьВручную = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Пересобирает ожидаемую продукцию по требованию пользователя и снимает признак ручной правки: команда для того и
// нужна, чтобы вернуться к расчёту после собственных изменений.
//
// Параметры:
//  Команда - КомандаФормы - команда таблицы продукции.
//
&НаКлиенте
Процедура ЗаполнитьОжидаемуюПродукцию(Команда)
	ПродукцияПравиласьВручную = Ложь;
	ЗаполнитьОжидаемуюПродукциюНаСервере(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Пересчёт ожидаемой продукции по строкам товаров. Молча не затирает ручную правку: пользователь, поправивший
// продукцию, владеет ею до нажатия «Заполнить по заказу».
//
// Параметры:
//  Удаляемые - Массив, Неопределено - идентификаторы удаляемых строк товаров, исключаемых из расчёта.
//
&НаКлиенте
Процедура ПересобратьОжидаемуюПродукцию(Удаляемые = Неопределено)
	Если ПродукцияПравиласьВручную Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьОжидаемуюПродукциюНаСервере(Удаляемые);
КонецПроцедуры

// Зовёт то же правило, что обработка заполнения и проведение: Документы.ПередачаВПереработку.ОжидаемаяПродукцияПередачи.
// Весь документ на сервер не переносится - только строки товаров.
//
// Параметры:
//  Удаляемые - Массив, Неопределено - см. ПересобратьОжидаемуюПродукцию.
//
&НаСервере
Процедура ЗаполнитьОжидаемуюПродукциюНаСервере(Знач Удаляемые)
	Если ТипЗнч(Объект.Основание) <> Тип("ДокументСсылка.ЗаказПокупателя") Или Не ЗначениеЗаполнено(Объект.Основание) Тогда
		Возврат;
	КонецЕсли;
	ТЗТовары = Объект.ТЧТовары.Выгрузить();
	Если ТипЗнч(Удаляемые) = Тип("Массив") Тогда
		Для Каждого Идентификатор Из Удаляемые Цикл
			Строка = Объект.ТЧТовары.НайтиПоИдентификатору(Идентификатор);
			Если Строка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Индекс = Объект.ТЧТовары.Индекс(Строка);
			Если Индекс >= 0 И Индекс < ТЗТовары.Количество() Тогда
				ТЗТовары[Индекс].Количество = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Продукция = Документы.ПередачаВПереработку.ОжидаемаяПродукцияПередачи(Объект.Основание, ТЗТовары);
	Объект.ТЧГотоваяПродукция.Загрузить(Продукция);
	Для Каждого Стр Из Объект.ТЧГотоваяПродукция Цикл
		Стр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧГотоваяПродукция);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПоказатьСебестоимость()
	// Себестоимость списанного сырья по движениям проведённого документа.
	ТЗСебестоимость = РегистрыНакопления.ТоварыВНаличии.ПолучитьСебестоимостьПоДокументу(Объект.Ссылка);
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		Отбор = Новый Структура("Номенклатура, Характеристика, Серия", Стр.Номенклатура, Стр.Характеристика, Стр.Серия);
		Отбор.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход);
		Мас = ТЗСебестоимость.НайтиСтроки(Отбор);
		Если Мас.Количество() = 0 Тогда
			Стр.Себестоимость = 0;
		ИначеЕсли Мас[0].Количество = Стр.Количество Тогда
			Стр.Себестоимость = Мас[0].Сумма;
		Иначе
			Стр.Себестоимость = Мас[0].Сумма / Мас[0].Количество * Стр.Количество;
		КонецЕсли;
	КонецЦикла;
	ОбщаяСебестоимость = ТЗСебестоимость.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавленияНоменклатуры(Результат, ДополнительныеПараметры) Экспорт
	Штрихкод = ДополнительныеПараметры.Штрихкод;
	СтруктураТовара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
	РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод, Объект, СтруктураТовара, , , ЭтотОбъект);
	// Сканирование - штатный способ набора строк этого документа, оборудование подключается при открытии формы.
	ПересобратьОжидаемуюПродукцию();
КонецПроцедуры

#КонецОбласти
